In [4]:
import pandas as pd
import numpy as np
import matplotlib as plt
%matplotlib inline

In [8]:
df = pd.DataFrame({'studentId':[1, 2222, 3333, 4444],'name':['Juan', 'Ana', 'Maria', 'Laura'], 'lastname': ['Perez', 'Rodriguez', 'Smith', 'Calderon'], 'grade': [7, 8, 9, 10]})

In [9]:
df

   grade   lastname   name  studentId
0      7      Perez   Juan          1
1      8  Rodriguez    Ana       2222
2      9      Smith  Maria       3333
3     10   Calderon  Laura       4444

In [8]:
df.dtypes

grade         int64
lastname     object
name         object
studentId     int64
dtype: object

In [9]:
df['grade']

0     7
1     8
2     9
3    10
Name: grade, dtype: int64

In [11]:
grades = df['grade']

In [13]:
df.memory_usage(deep=True)

Index         80
grade         32
lastname     255
name         245
studentId     32
dtype: int64

In [14]:
df.memory_usage(deep=True).sum()

644

In [15]:
df['grade'] = df['grade'].astype('float32')

In [16]:
df.memory_usage(deep=True).sum()

628

In [17]:
df2 = pd.DataFrame({'studentId':[np.NaN, 2222, 3333, 4444],'name':['Juan', 'Ana', 'Maria', 'Laura'], 'lastname': ['Perez', 'Rodriguez', 'Smith', 'Calderon'], 'grade': [7, 8, 9, 10]})

In [18]:
df2

   grade   lastname   name  studentId
0      7      Perez   Juan        NaN
1      8  Rodriguez    Ana     2222.0
2      9      Smith  Maria     3333.0
3     10   Calderon  Laura     4444.0

In [19]:
df.shape

(4, 4)

In [20]:
df.size

16

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
grade        4 non-null float32
lastname     4 non-null object
name         4 non-null object
studentId    4 non-null int64
dtypes: float32(1), int64(1), object(2)
memory usage: 192.0+ bytes

In [24]:
df.describe()

           grade    studentId
count   4.000000     4.000000
mean    8.500000  2777.500000
std     1.290994  1434.294833
min     7.000000  1111.000000
25%     7.750000  1944.250000
50%     8.500000  2777.500000
75%     9.250000  3610.750000
max    10.000000  4444.000000

In [25]:
df.drop(2)

   grade   lastname   name  studentId
0    7.0      Perez   Juan       1111
1    8.0  Rodriguez    Ana       2222
3   10.0   Calderon  Laura       4444

In [26]:
df.drop('name', axis='columns')

   grade   lastname  studentId
0    7.0      Perez       1111
1    8.0  Rodriguez       2222
2    9.0      Smith       3333
3   10.0   Calderon       4444

In [27]:
df

   grade   lastname   name  studentId
0    7.0      Perez   Juan       1111
1    8.0  Rodriguez    Ana       2222
2    9.0      Smith  Maria       3333
3   10.0   Calderon  Laura       4444

In [28]:
df['name']

0     Juan
1      Ana
2    Maria
3    Laura
Name: name, dtype: object

In [32]:
df[['name','grade']]

    name  grade
0   Juan    7.0
1    Ana    8.0
2  Maria    9.0
3  Laura   10.0

In [34]:
df.loc[2,:]

grade            9
lastname     Smith
name         Maria
studentId     3333
Name: 2, dtype: object

In [35]:
df.loc[[2],:]

   grade lastname   name  studentId
2    9.0    Smith  Maria       3333

In [36]:
df.loc[:,'grade']

0     7.0
1     8.0
2     9.0
3    10.0
Name: grade, dtype: float32

In [37]:
type(df.loc[:,'grade'])

pandas.core.series.Series

In [38]:
df.loc[:,['grade']]

   grade
0    7.0
1    8.0
2    9.0
3   10.0

In [40]:
df.loc[:2,['grade']]

   grade
0    7.0
1    8.0
2    9.0

In [41]:
df.loc[:2,['grade', 'name']]

   grade   name
0    7.0   Juan
1    8.0    Ana
2    9.0  Maria

In [43]:
df.loc[0:1,['grade', 'name']]

   grade  name
0    7.0  Juan
1    8.0   Ana

In [44]:
df.loc[0:4:2,['grade', 'name']]

   grade   name
0    7.0   Juan
2    9.0  Maria

In [47]:
df['grade'] >= 9

0    False
1    False
2     True
3     True
Name: grade, dtype: bool

In [48]:
df.iloc[0:2, 0:2]

   grade   lastname
0    7.0      Perez
1    8.0  Rodriguez

In [49]:
df

   grade   lastname   name  studentId
0    7.0      Perez   Juan       1111
1    8.0  Rodriguez    Ana       2222
2    9.0      Smith  Maria       3333
3   10.0   Calderon  Laura       4444

In [50]:
df.iloc[[2], :]

   grade lastname   name  studentId
2    9.0    Smith  Maria       3333

In [51]:
df.set_index('lastname')

           grade   name  studentId
lastname
Perez        7.0   Juan       1111
Rodriguez    8.0    Ana       2222
Smith        9.0  Maria       3333
Calderon    10.0  Laura       4444

In [52]:
df = df.set_index(['lastname', 'name'])

In [53]:
df

                 grade  studentId
lastname  name
Perez     Juan     7.0       1111
Rodriguez Ana      8.0       2222
Smith     Maria    9.0       3333
Calderon  Laura   10.0       4444

In [54]:
df.reset_index()

    lastname   name  grade  studentId
0      Perez   Juan    7.0       1111
1  Rodriguez    Ana    8.0       2222
2      Smith  Maria    9.0       3333
3   Calderon  Laura   10.0       4444

In [57]:
df

                 grade  studentId
lastname  name
Perez     Juan     7.0       1111
Rodriguez Ana      8.0       2222
Smith     Maria    9.0       3333
Calderon  Laura   10.0       4444

In [58]:
df = df.reset_index()

In [60]:
df.iat[2,3]

3333

In [61]:
df

    lastname   name  grade  studentId
0      Perez   Juan    7.0       1111
1  Rodriguez    Ana    8.0       2222
2      Smith  Maria    9.0       3333
3   Calderon  Laura   10.0       4444

In [63]:
df.iat[2,1]

'Maria'

In [64]:
df.at[1, 'name']

'Ana'

In [65]:
####PEPE

#### PEPE